BackEnd/SourceCode/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "language_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Jumanji"], ["content", "The best movie ever!!!! "], ["user_id", 27], ["language_id", 2], ["created_at", "2020-05-07 16:09:51.571276"], ["updated_at", "2020-05-07 16:09:51.571276"]]
---
  def create
    @post = Post.new(post_params)

    if @post.save