BackEnd/SourceCode/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "username", "email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "SamChen"], ["username", "samchan"], ["email", "samhaihuanchen@yahoo.com"], ["password", "123"], ["created_at", "2020-05-04 21:43:52.170404"], ["updated_at", "2020-05-04 21:43:52.170404"]]